Catalogs/ШаблоныКомнатДляЗаказДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныКомнатДляЗаказДоговора</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыИндивидуальные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыИндивидуальные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ДокументУстановкиЦены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ШаблоныКомнатДляЗаказДоговора/Forms/ФормаПодбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ВидЦены = Параметры.ВидЦены;
	Если ВидЦены.Пустая() Тогда
		ВидЦены = ПолучитьОсновнойТипЦенПродажи();
	КонецЕсли;
		
	Валюта = Параметры.Валюта;
	Если Валюта.Пустая() Тогда
		Валюта = ПолучитьФункциональнуюОпцию("ВалютаУчета");
	КонецЕсли;
	
	ИспользоватьИндивидуальныеЦены = ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены");
			
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент И НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		АдресВХранилище = ЗаписатьПодборВХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	Иначе
		АдресВХранилище = Неопределено;
	КонецЕсли;
	
	Если АдресВХранилище <> Неопределено Тогда
		Структура = Новый Структура("АдресВХранилище", АдресВХранилище);
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДокумента = Новый Структура("ИспользоватьИндивидуальныеЦены, Валюта, ВидЦены, Контрагент, ДоговорКонтрагента");
	ЗаполнитьЗначенияСвойств(ПараметрыДокумента, ЭтотОбъект);
	ДанныеШаблона = ПолучитьДанныеШаблона(ТекущиеДанные.Ссылка, ПараметрыДокумента);
	Состав.Очистить();
	Для каждого СтрокаТЗ из ДанныеШаблона.Состав Цикл
		НоваяСтрока = Состав.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеШаблона(ШаблонСсылка, ПараметрыДокумента)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ШаблонСсылка);
	Запрос.УстановитьПараметр("ИспользоватьИндивидуальныеЦены", ПараметрыДокумента.ИспользоватьИндивидуальныеЦены);
	Запрос.УстановитьПараметр("Валюта", ПараметрыДокумента.Валюта);
	Запрос.УстановитьПараметр("ВидЦены", ПараметрыДокумента.ВидЦены);
	Запрос.УстановитьПараметр("Контрагент", ПараметрыДокумента.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ПараметрыДокумента.ДоговорКонтрагента);
	Запрос.Текст = 
	
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.Цена
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Отменена КАК Отменена
	|ПОМЕСТИТЬ ВТ_ИндивидуальныеЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыИндивидуальные.СрезПоследних(
	|			,
	|			Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента
	|				И Валюта = &Валюта) КАК ЦеныНоменклатурыИндивидуальныеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Состав.Номенклатура КАК Номенклатура,
	|	Состав.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Состав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Состав.Коэффициент КАК Коэффициент,
	|	Состав.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ЦеныНоменклатурыИндивидуальныеСрезПоследних.Цена ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ЦеныНоменклатурыИндивидуальныеСрезПоследних.Отменена
	|						ТОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.Цена
	|					ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	Справочник.ШаблоныКомнатДляЗаказДоговора.ТоварыУслуги КАК Состав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|				ВидЦены = &ВидЦены
	|					И Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО Состав.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И Состав.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|			И Состав.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальныеЦены КАК ЦеныНоменклатурыИндивидуальныеСрезПоследних
	|		ПО (&ИспользоватьИндивидуальныеЦены)
	|			И Состав.Номенклатура = ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура
	|			И (Состав.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры)
	|			И Состав.ЕдиницаИзмерения = ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения
	|ГДЕ
	|	Состав.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Состав.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	Результат.Вставить("Состав", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса.Выгрузить()));
	
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
		
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновнойТипЦенПродажи()
	Возврат Справочники.ВидыЦен.ОсновнаяЦенаПродажи;
КонецФункции

&НаСервере
Функция ЗаписатьПодборВХранилище(УникальныйИдентификаторВладельца) 
		
	АдресВХранилище = Неопределено;	
	Если ПеренестиВДокумент Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(Состав.Выгрузить(), УникальныйИдентификаторВладельца);	
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции

&НаКлиенте
Процедура СоставПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
